app/Models/Default_model.php

	public function select_by_id_mytask($tableName,$id,$select=''){

		$mainQuery = $this->db->table('tasks apd');

		if ($select) {
			$mainQuery->select($select);
		} else {
			$mainQuery->select('apd.id, apd.status, apd.project_id, apd.task_title, apd.mode, apd.due_date');
		}


		$subQueryprojectName = "(SELECT p.project_title FROM tbl_project p
				WHERE p.id = apd.project_id) as project_title";

		$mainQuery->select($subQueryprojectName, false);


		$mainQuery->join('task_employee drt', 'apd.id = drt.task_id', 'inner');
		$mainQuery->groupBy('apd.id');
	    $mainQuery->where('apd.id', $id);
	    $results = $mainQuery->get()->getRowArray();
---
SELECT *
FROM `tbl_employees`
SELECT *
FROM `tbl_project`

    public function select_task2($empid,$select = '') {
		$mainQuery = $this->db->table('tasks apd');

		if ($select) {
			$mainQuery->select($select);
		} else {
			$mainQuery->select('apd.id, apd.status, apd.project_id, apd.task_title, apd.mode, apd.due_date,apd.assigned_by,apd.type,apd.created_date');
		}


		$subQueryprojectName = "(SELECT p.project_title FROM tbl_project p
								  WHERE p.id = apd.project_id) as project_title";
		$mainQuery->select($subQueryprojectName, false);
	    $mainQuery->where('apd.status', 0);
		$mainQuery->where('apd.mode', 0);
		$mainQuery->where('apd.assigned_by',$empid);
		$mainQuery->where('apd.type',1);

		$mainQuery->orderBy('apd.id', 'desc');
		$results = $mainQuery->get()->getResultArray();
---
SELECT `apd`.`id`, `apd`.`status`, `apd`.`project_id`, `apd`.`task_title`, `apd`.`mode`, `apd`.`due_date`, `apd`.`assigned_by`, `apd`.`type`, `apd`.`created_date`, (SELECT p.project_title FROM tbl_project p
								  WHERE p.id = apd.project_id) as project_title
FROM `tasks` `apd`
WHERE `apd`.`status` = 0
AND `apd`.`mode` = 0
AND `apd`.`assigned_by` = 1
AND `apd`.`type` = 1
ORDER BY `apd`.`id` DESC

	public function select_taskProgress2($empid,$select=''){
		$mainQuery = $this->db->table('tasks apd');

		if ($select) {
			$mainQuery->select($select);
		} else {
			$mainQuery->select('apd.id, apd.status, apd.project_id, apd.task_title, apd.mode, apd.due_date,apd.assigned_by,apd.type,apd.created_date');
		}


		$subQueryprojectName = "(SELECT p.project_title FROM tbl_project p
								  WHERE p.id = apd.project_id) as project_title";
		$mainQuery->select($subQueryprojectName, false);
		$mainQuery->where('apd.status', 1);
		$mainQuery->where('apd.mode', 0);
		$mainQuery->where('apd.assigned_by',$empid);
		$mainQuery->where('apd.type',1);
		$mainQuery->orderBy('apd.id', 'desc');

		$results = $mainQuery->get()->getResultArray();
---
SELECT `apd`.`id`, `apd`.`status`, `apd`.`project_id`, `apd`.`task_title`, `apd`.`mode`, `apd`.`due_date`, `apd`.`assigned_by`, `apd`.`type`, `apd`.`created_date`, (SELECT p.project_title FROM tbl_project p
								  WHERE p.id = apd.project_id) as project_title
FROM `tasks` `apd`
WHERE `apd`.`status` = 1
AND `apd`.`mode` = 0
AND `apd`.`assigned_by` = 1
AND `apd`.`type` = 1
ORDER BY `apd`.`id` DESC

	public function select_taskCompleted2($empid,$select=''){
		$mainQuery = $this->db->table('tasks apd');

		if ($select) {
			$mainQuery->select($select);
		} else {
			$mainQuery->select('apd.id, apd.status, apd.project_id, apd.task_title, apd.mode, apd.due_date,apd.assigned_by,apd.type,apd.created_date');
		}


		$subQueryprojectName = "(SELECT p.project_title FROM tbl_project p
								  WHERE p.id = apd.project_id) as project_title";
		$mainQuery->select($subQueryprojectName, false);
		$mainQuery->where('apd.status', 2);
		$mainQuery->where('apd.mode', 0);
		$mainQuery->where('apd.assigned_by',$empid);
		$mainQuery->where('apd.type',1);
		$mainQuery->orderBy('apd.id', 'desc');


		$results = $mainQuery->get()->getResultArray();
---
SELECT `apd`.`id`, `apd`.`status`, `apd`.`project_id`, `apd`.`task_title`, `apd`.`mode`, `apd`.`due_date`, `apd`.`assigned_by`, `apd`.`type`, `apd`.`created_date`, (SELECT p.project_title FROM tbl_project p
								  WHERE p.id = apd.project_id) as project_title
FROM `tasks` `apd`
WHERE `apd`.`status` = 2
AND `apd`.`mode` = 0
AND `apd`.`assigned_by` = 1
AND `apd`.`type` = 1
ORDER BY `apd`.`id` DESC